import { Routes, Route, Navigate, useLocation  } from "react-router-dom";
import { useEffect } from "react";
import Navbar from "./components/Navbar";
import Home from "./pages/Home";
import Portfolio from "./pages/Portfolio";
import About from "./pages/About";
import Contacts from "./pages/Contacts";
import ProductDetail from "./pages/ProductDetail";
import Footer from "./components/footer";

function App() {
  const { pathname } = useLocation();
  const routesData = [
    {
      name: "Визитки",
      description:
        "<p class='pb-4'><strong>Визитная карточка (визитка)</strong> — традиционный носитель контактной информации о человеке или организации. Изготавливается из бумаги, картона или пластика небольшого формата, размером 50×90 мм. И 86х54 мм. Визитка включает имя владельца, компанию (обычно с логотипом) и контактную информацию (адрес, телефонный номер и/или адрес электронной почты).</p>",
      url: "vizitki",
      images: ["vizitka.jpg", "vizitka1.jpg"],
    },
    {
      name: "Ежедневник",
      description:
        "<p class='pb-4'>В нашей типографии Вы можете заказать корпоративные <strong>ежедневники</strong> с логотипом компании. Ежедневник является отличным подарком от компании и в тоже время одним из действующих рекламных средств. Поэтому все больше компаний стремится создать или разработать свой уникальный дизайн ежедневника, который сможет максимально точно отражать все положительные черты предприятия.</p>",
      url: "ejednevniki",
      images: ["Ezhednevnik.jpg", "Ezhednevnik1.jpg"],
    },
    {
      name: "Брошюры",
      description: `<p class='pb-4'><strong>Брошюра</strong> - непериодическое печатное издание. Печать брошюры происходит офсетной или цифровой печатью в типографиях. Данный носитель имеет не менее 4 страниц, но не более 48 страниц. Обложки изготавливается из плотного граммажа офсетной бумаги (грамм 200), а блок из неплотного (грамм 90). Часто нанесение происходит черной краской, что снижает стоимость готовой продукции. Соответственно цена брошюры с полноцветной картинкой выходит дороже нежели, чем печать чернобелой. Полноцветные брошюры еще называют каталогами. В них размещают информацию о товарах и услугах той или иной фирмы.</p><p class='pb-4'>Брошюра (каталог) значимый и мощный инструмент для маркетинга и рекламы. С помощью данных носителей информация подается потенциально заинтересованным людям, который в свою очередь получает достаточную информацию об услуге или о продукте компании.</p><p class='pb-4'>Изготовление брошюр происходит в несколько этапов: дизайн (дизайн-макет), верстка материалов, печать происходит офсетным или цифровым способом. Офсет выгоден при больших тиражах, но занимает больше времени, а цифра, выгодна при малых и затрачивает меньше времени на производство, на выходе цена единицы будет дешевле почти в два раза, при малом количестве.</p><p class='pb-4'>Послепечатный процесс. В него входит: ламинация, тиснение, вырубка, возможно нанесение лака, далее подбор тетрадей, сборка рекламной брошюры. </p>`,
      url: "broshuri",
      images: ["Broshyury.jpg"],
    },
    {
      name: "Журналы",
      description:
        "<p class='pb-4'><strong>Журналы</strong> - это одно из наиболее востребованных и популярных средств массовой информации. Они выходят периодически или регулярно, состоят, как правило, из материалов, распределенных по отдельным рубрикам. В них публикуют художественные произведения и публицистику, статьи, обзоры по вопросам общественной, политической, научной, производственной жизни.</p>",
      url: "jurnali",
      images: ["ZHurnaly.jpg"],
    },
    {
      name: "Буклеты",
      description: `<p class='pb-4'><strong>Буклет</strong> - прежде всего печатное не периодическое издание, которое, как правило, носит в себе информационно-рекламный контент. Ни одна компания не обходится без него, ведь в нем можно рассказать не только о своем продукте, но и об услуге.</p> <p class='pb-4'>Производство буклетов одно из направлений деятельности нашей типографии, осуществляется в несколько этапов. Изготовление рекламного буклета носит не много операций, а именно печать, фальцовку, резку под формат. Фальцовка - складывание заготовок по полосам, сгибов бывает многожество, данная технология имеет несколько разных конфигураций: гармошкой, дельтообразные, с поперечными фальцами. Иногда клиенты хотят заказать брошюру, но при этом имеет в виду буклет. Брошюра кардинально отличается от буклета, если следовать правильной полиграфической терминологии. К первой относится непериодическое издание, объемом от четырех до сорока восьми страниц, с обложкой отличающейся плотностью от блока и скреплением листов и обложки на клей или скобу или как вариант на пружину.</p><p class='pb-4'>Производство брошюры гораздо сложнее. Оно состоит из скольких этапов, а именно: создание макета, верстка текста, печать и постпечатные работы (скрепление и резка под формат).</p><ul class='p-4 list-disc'><li>А6 105*148 мм (в развернутом виде 210*148, 1 фальц)</li><li>А6 105*148 мм (в развернутом виде 210*148, 1 фальц)</li><li>Мини 99*210 мм (в развернутом виде 198*210 мм, 1 фальц)</li><li>Евробуклет 99*210 мм, (в развернутом виде 197*210 мм, 2 фальца)</li><li>А4 210*297 мм, (в развернутом виде 420*210мм, 1 фальц)</li></ul> <img src="/assets/buklet.jpg" class='my-3' alt=""><p class='pb-4'>Часто при производства используют мелованную бумагу средней плотности 130-150 грамм. При не плотной бумаге используют фальцовку. Для бюджетных буклетов, которые часто можно увидеть в наших почтовых ящиках берут офсетную бумагу грамм 100. Такая бумага подходит для массового распространения и большим спросом не пользуется. От 170 грамм буклеты лучше биговать, так как краска на сгибах может потрескаться.</p>`,
      url: "bukleti",
      images: [
        "buklety.jpg",
        "buklety1.jpg",
        "buklety2.jpg",
        "buklety3.jpg",
        "buklety4.jpg",
      ],
    },

    {
      name: "Кепки",
      description:
        "<p class='pb-4'><strong>Кепки с логотипами</strong> компании или названием бренда становятся отличной рекламой, и в качестве сувенирной продукции, и как элемент формы работников. Во время общения с сотрудником компании в фирменной кепке клиент будет постоянно видеть название, и оно обязательно отложится в памяти. Корпорации заказывают одинаковые фирменные бейсболки для своих сотрудников для поднятия командного духа и повышения корпоративной культуры. Спортивным командам также не обойтись без одинаковых бейсболок с названием или символом команды.</p>",
      url: "kepki",
      images: ["Kepki.jfif"],
    },
    {
      name: "Полиэтиленовые пакеты",
      description:
        "<p class='pb-4'><strong>Полиэтиленовые пакеты</strong> находят широкое применение в качестве основных видов тары практически для любых целей современного обихода. В бизнес-сфере изготовленные полиэтиленовых пакетов с логотипом – неизменный атрибут презентаций, конференций, промоакций и выставок, где они используются для упаковки сувенирной, презентационной и информационной продукции. Актуальна печать полиэтиленовых пакетов для подарочной упаковки. Обыкновенная коробка конфет или бутылка вина в красиво выполненном полиэтиленовом пакете приобретает праздничный и оригинальный вид. В условиях конкуренции печать на полиэтиленовых пакетах с фирменной символикой служит эффективным маркетинговым инструментом и выгодным вложением средств.</p>",
      url: "plastikPaketi",
      images: ["poly.jpg"],
    },

    {
      name: "Листовки",
      description: `<p class='pb-4'><strong>Листовки</strong> представляют собой бумажный носитель, на котором размещается информация общественного или рекламного характера. Главные характеристики листовок — это лаконичность, небольшой формат и доступность. Листовки считаются эффективным рекламным инструментом для проведения акций, распродаж, мероприятий и для информирования горожан об открытии новых магазинов, салонов, кафе. Данный рекламный носитель подходит также для распространения на презентациях, праздниках, промо-акциях и выставках.</p><p class='pb-4'>Разработка и изготовление листовок должны осуществляться профессионалами: только тогда она даст ожидаемый рекламный эффект: приток новых покупателей, увеличение числа участников акции и т.д. Специалисты нашей компании имеют солидный опыт в создании листовок, поэтому мы готовы предложить действительно работающие варианты. Создание листовки начинается с разработки дизайна листовки. Информация и визуальные образы должны быть лаконичными и быстро запоминаться. </p><p class='pb-4'>Одна из главных задач — сделать листовку оригинальной и интригующей, чтобы выделить предложение Вашей компании из информационной среды конкурентов. Горожане получают множество листовок в день, и Ваша должна быть самой привлекательной. При этом оформление обязано сразу удерживать внимание, чтобы у получателя листовки возникло желание ознакомиться с Вашим предложением. </p>`,
      url: "listovki",
      images: ["listovki.jpg"],
    },

    {
      name: "Грамоты | Сертификаты",
      description:
        "<p class='pb-4'><strong>Дипломы, грамоты и сертификаты</strong> - это полиграфическая продукция, удостоверяющая, подтверждающая или выступающая в роли награды организации или отдельного человека за достижения в различных конкурсах, выставках, соревнованиях, мероприятиях и так далее. Обычно дипломы, грамоты и сертификаты печатаются на плотной мелованной бумаге от 200 г/м2 до 300 г/м2, а затем помещаются в рамки для дипломов, но также часто заказчики предпочитают печать сертификатов, грамот и дипломов на дизайнерской бумаге, печать сертификатов дипломов и грамот с фольгированием, с матовой или глянцевой ламинацией или другими эффектами.</p>",
      url: "gramoti",
      images: ["Diplomy.jpg"],
    },

    {
      name: "Значки",
      description: `<p class='pb-4'><strong>Значки</strong> – это разновидность сувенирной продукции, применение которой возможно во многих областях деятельности человека.</p><p class='pb-4'>Основной сферой применения полиграфических значков всё же остаётся рекламная деятельность. Те незначительные средства, которые были потрачены на их приобретение, окупятся с лихвой в кратчайшие сроки, принося гораздо большую прибыль, чем иные промо-материалы. Это объясняется длительным сроком службы значков.</p>`,
      url: "znachki",
      images: ["Znachki.jpg", "Znachki1.jpg"],
    },

    {
      name: "Бумажные пакеты",
      description:
        "<p class='pb-4'><strong>Бумажные пакеты</strong> находят широкое применение в качестве основных видов тары практически для любых целей современного обихода. Книжные магазины, бутики одежды, нижнего белья, продуктовые супермаркеты, заведения общественного питания и многие другие организации выбирают бумажные пакеты для упаковки своей продукции. В бизнес-сфере изготовленные бумажные пакеты с логотипом – неизменный атрибут презентаций, конференций, промоакций и выставок, где они используются для упаковки сувенирной, презентационной и информационной продукции. Актуальна печать бумажных пакетов для подарочной упаковки. Обыкновенная коробка конфет или бутылка вина в красиво выполненном бумажном пакете приобретает праздничный и оригинальный вид. В условиях конкуренции печать на бумажных пакетах с фирменной символики служит эффективным маркетинговым инструментом и выгодным вложением средств.</p>",
      url: ":umajnuePoketi",
      images: [
        "BumazhnyePakety.jpg",
        "BumazhnyePakety1.jpg",
        "BumazhnyePakety3.jpg",
      ],
    },
    {
      name: "Брелки металлические",
      description: `<p class='pb-4'>Большинство руководителей компаний знают, что в условиях кризисной конкуренции сложно создать устойчивый бизнес, если не заниматься продвижением имиджа бренда и товаров своей фирмы. Им требуется постоянно пополнять запасы качественной промо-продукции и рекламных презентов разной стоимости. Брелоки с логотипом компании являются прекрасным, недорогим инструментом создания положительного имиджа мелкой организации и крупного предприятия. </p><p class='pb-4'><strong>Брелок</strong>, созданный с применением современных способов нанесения изображений, будет долговечным и красочным. Его не стыдно использовать даже директорам собственных компаний и руководителям фирм-партнеров. </p>`,
      url: "brelki",
      images: ["brelok.jpg", "brelok1.jpg"],
    },
    {
      name: "Каталог",
      description:
        "<p class='pb-4'><strong>Каталог</strong> — многостраничное издание, включающее перечень товаров, продаваемых или производимых какой-либо организацией. Каталоги распространяют в точках продаж, на выставках, при помощи почтовой рассылки. Они могут быть предназначены для широкой аудитории потребителей, для оптовиков или специалистов каких-либо областей промышленности. </p>",
      url: "katalog",
      images: ["Katalog.jpg", "Katalog1.jpg"],
    },

    {
      name: "Коробки",
      description: `<p class='pb-4'>Наша типография специализируется на решении нестандартных задач по изготовлению всех видов полиграфии, включая <strong>коробки с логотипом компании</strong>. Современное оборудование, квалифицированный персонал и креативный подход к выполнению заказа позволяет гарантировать безупречное качество конечного результата. Изготовленная нами брендированная упаковка не только станет «визитной карточной» вашего продукта, но поможет значительно увеличить продажи за счет узнаваемости среди целевой аудитории.</p><p class='pb-4'>Фирменная упаковка может производится несколькими способами: офсетной и цифровой печатью. В зависимости от вида печати зависит срок изготовления полиграфии. Узнать точное время на производство брендированной упаковки вы можете у сотрудников типографии, которые с готовностью ответят на все интересующие вопросы и помогут выбрать оптимальный способ печати в соответствии с индивидуальными требованиями.</p>`,
      url: "korobki",
      images: ["Korobka.jpg"],
    },

    {
      name: "Билеты",
      description: `<p class='pb-4'><strong>Билет</strong> – это документ, который даёт право прохода на какое-либо важное мероприятие. У билетов, как у полиграфической продукции есть ряд своих особенностей:<br>- Билеты печатаются на различной бумаге, но в основном на плотной бумаге (для придания билету презентабельного вида);<br>- На билете может присутствовать голограмма;<br>- Каждый билет должен быть пронумерован, но также возможна печать билетов без нумерации (в зависимости от требований заказчика).</p>`,
      url: "bileti",
      images: ["bilety.jpeg", "bilety1.jpeg"],
    },

    {
      name: "Папки",
      description:
        "<p class='pb-4'><strong>Папка</strong> является упаковкой, предназначенной для  переноса и хранения документов. Изготавливают их из плотной бумаги, картона, пластика или кожи. Ни один офис не обходится без изготовления папок самых разных видов. Фирменные изделия используются не только в делопроизводстве компании, но и в целях рекламы, в силу чего они являются одними из популярнейших носителей рекламной полиграфии. Печать папок с логотипом в наше время являются эффективнейшим инструментом поднятия имиджа компании, укрепления ее репутации, роста популярности на рынке товаров и услуг. </p>",
      url: "papki",
      images: ["papki.jpg", "papki1.jpg", "papki2.jpg", "papki3.jpg"],
    },
    {
      name: "Календари",
      description: `<p class='pb-4'>Раньше были популярны отрывные календари. Тиражи такой продукции были просто гигантскими, производство календарей продолжалось весь год. Часто календарь используют в рекламных целях. Компании на носителях размещают логотипы для узнаваемости и рекламировании бренда, так называемые фирменные календари. Большим спросом пользуются квартальные календари выполненные на заказ, они состоят из топа (верхней части носителя), где можно напечатать логотип компании и блоков с рекламными полями, где можно напечатать фирменную символику, слоганы или контакты.</p><p class='pb-4'>Стоит отметить, изготовление и печать настенных перекидных календарей. Они менее популярны из-за своей дороговизны, но зато оригинально смотрятся из-за своей индивидуальности.</p><p class='pb-4'>Довольно часто на столах в офисах можно заметить настольные календари домики. Чем отличаются настольные домики от квартальных календарей? - спросите вы. Не только конфигурацией, но и мобильностью. Они небольшого формата, но есть одно общее, на них также крепятся блоки, точно такие же, как и на квартальных календарях.</p><p class='pb-4'>Существуют еще и карманные календари. Они нам знакомы из детства, когда каждый второй собирал для коллекции.</p><p class='pb-4'><strong>Календарь</strong> - отличная реклама и инструмент маркетинга, его выкинут после как рекламную листовку и не уберут в дальний ящик, как визитку.</p>`,
      url: "calendari",
      images: ["Kalendari.jpg", "Kalendari1.jpg", "Kalendari2.jpg"],
    },
    {
      name: "Меню",
      description: `<p class='pb-4'><strong>Меню</strong> – это стильно оформленный и упорядоченный перечень блюд с указанием наименований, цен и, при желании, с фотографиями. Такой вид полиграфической продукции востребован на сегодняшний день, поскольку все больше открывается различных мест общественного питания.</p><p class='pb-4'><strong>Для каких заведений мы можем изготовить меню?</strong></p><ul class="text-left list-disc ul-p p-4"><li>Меню для кофейни</li><li>Меню для ресторана</li><li>Меню для бургерной</li><li>Меню для кафе</li><li>Меню для кальянной</li><li>Детские меню</li></ul>`,
      url: "menu",
      images: ["menu.jpg"],
    },
    {
      name: "Модульные картины",
      description: `<p class='pb-4'><strong>Модельные картины</strong> представляют собой модное украшение любого интерьера. По своей сути - это репродукции картин известных художников, удачные фотографии, даже детские рисунки, которые разделены на несколько сегментов и повешены на стену. </p><p class='pb-4'>Модульная картина может состоять из нескольких прямоугольников с фрагментами одного полотна с одним сюжетом. Иногда фотографы составляют модульную картину из нескольких однотипных кадров, имитирующих последовательное "движение". </p>`,
      url: "modulnueKarnini",
      images: ["modulka.jpg", "modulka1.jpg"],
    },
    {
      name: "Ручки",
      description: `<p class='pb-4'><strong>Ручки с логотипом</strong> являются одной из самых экономичных и долго работающих видов рекламной продукции. Придумано уже много способов рекламы для продвижения бренда компании и выигрышными из них всегда являются те, которые эффективно, но ненавязчиво напоминают клиентам о существовании какого-либо товара.</p><p class='pb-4'>Печать на ручках это один из таких способов, она превращает простой и необходимый предмет в элемент корпоративного стиля, способный привлечь взгляды многих людей.</p>`,
      url: "ruchki",
      images: [
        "Ruchki.jpg",
        "Ruchki2.jpg",
        "Ruchki3.jpg",
        "Ruchki4.jpg",
        "Ruchki5.jpg",
      ],
    },
    {
      name: "Бейджики",
      description: `<p class='pb-4'><strong>Бейджи</strong> – могут выполнять роль элемента униформы или же идентификации человека, который его носит. Часто бейджи используются в сфере услуг: это очень частый элемент униформы сотрудников различных предприятий или заведений представляющих сферы ритейла и услуг (клининговые, охранные компании; супермаркеты, транспортные другие предприятия).</p>`,
      url: "beidjiki",
      images: ["Bejdzhiki1.jpg", "Bejdzhiki3.jpg"],
    },

    

    {
      name: "Открытки",
      description: `<p class='pb-4'><strong>Открытки</strong> - печатное листовое издание разного формата, предназначенное для извещения о каком-либо событии или для поздравления. Открытки изготавливаются на плотной бумаге, при их производстве используются дополнительные полиграфические услуги: биговка. Открытка — это милый сердцу, приятный сувенир, поэтому так важна яркость, красочность, богатая палитра и высокое качество полиграфии. </p>`,
      url: "otkrutki",
      images: ["Otkrytki.jpg"],
    },

    {
      name: "Пластиковые карты",
      description: `<p class='pb-4'><strong>Пластиковые карты</strong> широко используются в программах лояльности. Их наличие у продавца решает важные бизнес-задачи. Скидочные или бонусные карты привлекают, удерживают клиентов и способствуют увеличению продаж. К таким изделиям предъявляются определенные требования. Карты должны быть функциональными, презентабельными. Современные технологии обработки пластика и печати на нем позволяют изготавливать эксклюзивные изделия, выполняющие еще и имиджевые функции. </p>`,
      url: "plastikKarti",
      images: [
        "Plastikovye-karty.jpg",
        "Plastikovye-karty1.jpg",
        "Plastikovye-karty2.jpg",
      ],
    },

    {
      name: "Постеры",
      description: `<p class='pb-4'><strong>Постер (Плакат)</strong>  - листовой носитель рекламного или информационного характера производимый в типографии. Возможно изготовление из различных материалов, а печать разных форматов</p><p class='pb-4'>Начнем с того, что постеры бывают нескольких основных типов:</p><ul class="text-left ul-p p-4"><li>Агитационные</li><li>Мотивирующие</li><li>Рекламные</li><li>Учебные</li><li>Репродукционные</li></ul><p class='pb-4'>Чаще всего для печати постеров берут мелованную бумагу. Если хотят напечатать дешевое полотно с изображением, которые можно увидеть на витринах магазинов, на различных стендах, то берут тонки материал, примерно 130 грамм. Самые распространенные форматы постеров: А4, А3, А2.</p><p class='pb-4'>Если зайти в клуб, в кафе, то мы можем увидеть постеры поплотнее, грамм 200 их специально печатают поплотнее, так как нет механических воздействий, когда на улице постоянно на них что-то влияет. Стоит отметить, что довольно часто заказчик просит напечатать продукцию на самоклеящейся бумаге, чтобы они дольше висели.</p>`,
      url: "posteri",
      images: ["poster.jpg"],
    },

    {
      name: "Рецептурники",
      description: `<p class='pb-4'>Медицинский вид блокнота для записей рецепта.  <strong>Рецептурник</strong> является практичным подарком от фамацевтической компании и в тоже время одним из действующих рекламных средств. Поэтому все больше компаний стремится создать или разработать свой уникальный дизайн рецептурника, который сможет максимально точно отражать все положительные черты предприятия.</p>`,
      url: "recepturniki",
      images: ["recept.jpeg", "recept1.jpeg"],
    },

    {
      name: "Стикеры (Самоклейка)",
      description: `<p class='pb-4'><strong>Стикером</strong>, как правило, считают наклейку или этикетку, предназначенную для уточнения информации на том или ином продукте или материале.</p><p class='pb-4'>Стикеры – это реклама. Раскручивание подобного рода появилось очень давно, так как оно многоинформативно и малозатратно. Сейчас люди даже не замечают, что такое неназойливое предложение того или иного товара присутствует повсюду – в общественном транспорте, на дверях или окнах. Реклама аналогичного вида уже воспринимается глазом, как должное.</p>`,
      url: "stikeri",
      images: ["Stikery.jpg"],
    },

    {
      name: "Толстовки",
      description: `<p class='pb-4'>Заинтересовать современного потребителя достаточно сложно, а порой, реклама может давать противоположный эффект. Поэтому, чтобы закрепиться в подсознании клиента, необходимо действовать ненавязчиво. Доказано, что именно яркие надписи и рисунки, даже если не заинтересовали потребителя при первой встрече, всплывают в памяти, когда необходимо найти определенную услугу или товар. Кроме того,изготовление фирменных толстовок не требует больших финансовых затрат.</p><p class='pb-4'>Чаще всего <strong>производство брендированных толстовок</strong> требуется перед промо-акциями, открытием или другими важными мероприятиями для компании. Очень выгодный ход, дарить футболку с логотипом клиентам и партнерам. Таким образом вы продвигаете бизнес на несколько шагов вперед:</p> <ul class="text-left list-disc p-4"><li>Располагаете к себе клиента/партнера</li><li>Раскручиваете свой бренд</li><li>Позиционируете себя как щедрую, самодостаточную компанию</li><li>Обеспечиваете себе постоянных покупателей</li></ul><p class='pb-4'>Это разумный маркетинговый ход, который обеспечивает уверенный старт и надежную репутацию в бизнесе. Компания и сотрудники всегда будут выгодно выделятся на фоне других предложений по товарам и услугам. Кроме того, это практичный вид одежды, который лаконично завершит положительный образ фирмы.</p>`,
      url: "tolstovki",
      images: ["tolstovka.jpg"],
    },

    {
      name: "Флаги",
      description: `<p class='pb-4'><strong>Рекламные флажки</strong> и большие флаги стали часто использоваться в настоящее время.На мероприятиях массового характера используются флажки. На политических выступлениях применяются флажки с изображением государственного флага. На рекламных акциях используют флажки с изображением бренда, марки продвигаемого товара, на спортивных мероприятиях – с изображением логотипов команд. Флажки имеют не высокую стоимость, но в тоже время быть яркими и привлекательными. Изготовление флажков осуществляется с применением самых простых материалов. </p>`,
      url: "flagi",
      images: ["flagi.jpg"],
    },

    {
      name: "Футболки",
      description: `<p class='pb-4'>Заинтересовать современного потребителя достаточно сложно, а порой, реклама может давать противоположный эффект. Поэтому, чтобы закрепиться в подсознании клиента, необходимо действовать ненавязчиво. Доказано, что именно яркие надписи и рисунки, даже если не заинтересовали потребителя при первой встрече, всплывают в памяти, когда необходимо найти определенную услугу или товар. Кроме того,изготовление фирменных футболок с логотипом не требует больших финансовых затрат.</p><p class='pb-4'>Чаще всего <strong>производство брендированных футболок</strong> требуется перед промо-акциями, открытием или другими важными мероприятиями для компании. Очень выгодный ход, дарить футболку с логотипом клиентам и партнерам. Таким образом вы продвигаете бизнес на несколько шагов вперед:</p> <ul class="text-left list-disc p-4"><li>Располагаете к себе клиента/партнера;</li><li>Раскручиваете свой бренд</li><li>Позиционируете себя как щедрую, самодостаточную компанию</li><li>Обеспечиваете себе постоянных покупателей</li></ul><p class='pb-4'>Это разумный маркетинговый ход, который обеспечивает уверенный старт и надежную репутацию в бизнесе. Компания и сотрудники всегда будут выгодно выделятся на фоне других предложений по товарам и услугам. Кроме того, это практичный вид одежды, который лаконично завершит положительный образ фирмы.</p>`,
      url: "futbolki",
      images: ["futbolka.jpg"],
    },
    {
      name: "Блокноты А5",
      description: `<p class='pb-4'>Самый удобный вид рекламной полиграфии — рекламный блокнот. Он упрощает жизнь делового человека. Блокноты используют в повседневной жизни для записей и хранения информации, и, несмотря на множество современных гаджетов, блокнот — незаменимая вещь на рабочем столе.</p><p class='pb-4'>Размер <strong>блокнота А5</strong> 147х210 мм - это самый популярный размер блокнота. Его легко носить с собой, в нем удобно писать.<br>Блокнот на пружинке А5-го формата используют для:</p><ul class="text-left list-disc ul-p p-4"><li>как рабочие тетради в офисе</li><li>для работы на семинарах и конференциях</li><li>рекламный материал для подарка бизнес-партнеру</li><li>скетчбук - тетрадь для набросков (листы в блоке из плотной чистой бумаги на которой удобно рисовать)</li></ul>`,
      url: "bloknotA5",
      images: [
        "Bloknoty-A5.jpg",
        "Bloknoty-A51.jpg",
        "Bloknoty-A512.jpg",
        "Bloknoty-A513.jpg",
      ],
    },
    {
      name: "Кубарики",
      description: `<p class='pb-4'><strong>Кубарики</strong> - это специальное изделие, предназначенное для записей. Представляет собой стопку листочков бумаги определенной формы. На листы кубарика могут быть нанесены элементы фирменного стиля компании, реквизиты, телефоны, логотип и т.д. В нашей типографии можно заказать практически весь набор услуг по производству кубариков: разработка оригинал-макета и изготовление кубариков офсетным методом и т.д. При этом обеспечивается высокая четкость печати изображения, а размер кубарика, вид бумаги выбирает заказчик.</p>`,
      url: "kubariki",
      images: ["Kubariki.jpg", "Kubariki1.jpg", "Kubariki2.jpg"],
    },
    {
      name: "Экосумки",
      description: `<p class='pb-4'><strong>Эко сумки</strong> один из популярных видов раздаточного материала, зачастую используется на различных крупных мероприятиях. Обладает повышенной износостойкостью. Благодаря чему, сумки можно использовать в последующем, после окончания мероприятия.</p>`,
      url: "ecosumki",
      images: ["ecosumka2.jpg"],
    },
  ];
  useEffect(() => {
    window.scrollTo(0, 0)
  }, [pathname])

  return (
    <div>
      <Navbar routesData={routesData} />
      <Routes>
        <Route path="/" element={<Home catalog={routesData} />} />
        <Route path="/portfolio" element={<Portfolio catalog={routesData} />} />
        <Route path="/about" element={<About />} />
        <Route path="/contacts" element={<Contacts />} />
        <Route path=":id" element={<ProductDetail detail={routesData} />} />
        <Route path="*" element={<Navigate to="/home" replace />} />
      </Routes>
      <Footer />
    </div>
  );
}

export default App;

